In [ ]:
ip_dic = {'192.168.70.172':'윤승욱', '192.168.0.38':'나예호','192.168.70.128': '김상민'}

In [2]:
from flask import Flask

# app : Server실행, 경로를 잡아주는 객체
app = Flask(__name__)

# '' : ''안에 html 들어감
@app.route('/')
def index():
    return '<h1>Hello World</h1>'

if __name__ == '__main__':
    app.run()

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://127.0.0.1:5000/ (Press CTRL+C to quit)
127.0.0.1 - - [21/Sep/2022 12:36:03] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [21/Sep/2022 12:36:03] "GET /favicon.ico HTTP/1.1" 404 -

In [7]:
from flask import Flask,request

# app : Server실행, 경로를 잡아주는 객체
app = Flask(__name__)

# '' : ''안에 html 들어감
@app.route('/')
def index():
    
    ip = request.remote_addr
    
    if ip == '192.168.70.8':
        return '경준님 안녕하세요~'
    elif ip == '192.168.70.51':
        return '누구인가'
    else:
        return '<h1>Hello World</h1>'

if __name__ == '__main__':
    app.run(host='192.168.70.172', port=5023)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://192.168.70.172:5023/ (Press CTRL+C to quit)
192.168.70.51 - - [21/Sep/2022 12:49:02] "GET / HTTP/1.1" 200 -
192.168.70.51 - - [21/Sep/2022 12:49:04] "GET /favicon.ico HTTP/1.1" 404 -

In [1]:
from flask import Flask, redirect

app = Flask(__name__)

@app.route('/')
def index():
    url = 'http://seungwook.dothome.co.kr'
    return redirect(url)

if __name__ == '__main__':
    app.run(host='192.168.70.172', port=5023)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://192.168.70.172:5023/ (Press CTRL+C to quit)
192.168.70.172 - - [22/Sep/2022 09:11:23] "GET / HTTP/1.1" 302 -

In [5]:
!pip install cx_Oracle

Requirement already satisfied: cx_Oracle in c:\users\ai\anaconda3\lib\site-packages (8.3.0)

In [2]:
# 환경변수 설정
import os
LOCATION = r"C:\Users\AI\instantclient_21_6"
os.environ["PATH"] = LOCATION + ";" + os.environ["PATH"]

In [6]:
import cx_Oracle

# DB 연결
- 1. Connection
- 2. Cursor
- 3. Execute
- 4. Close

## Connection

In [10]:
# 아이피주소가 계속 바뀌는 환경에서 자동으로 ip를 잡아줘야 할떄 쓰는 socket라이브러리
import socket
s = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
s.connect(("8.8.8.8", 80))
host_ip = s.getsockname()[0]

# 1. Connection
db_id = 'hr'
db_pw = 'hr'
db_url = f'{host_ip}:1521/xe'
conn = cx_Oracle.connect(db_id,db_pw,db_url)

# 2. cursor ; sql문을 전달하는 역할
curs = conn.cursor()

# 3. Execute : 실행하다
sql = 'select last_name, salary from employees'
result = curs.execute(sql)
# fetchall : 모든 값을 긁어오다
print(result.fetchall())

# 4. Close
# 연결 통로를 닫을 때는, 열었던 역순으로 닫는다
if curs != None:
    curs.close()
if conn != None:
    conn.close()

[('King', 24000.0), ('Kochhar', 17000.0), ('De Haan', 17000.0), ('Hunold', 9000.0), ('Ernst', 6000.0), ('Austin', 4800.0), ('Pataballa', 4800.0), ('Lorentz', 4200.0), ('Greenberg', 12008.0), ('Faviet', 9000.0), ('Chen', 8200.0), ('Sciarra', 7700.0), ('Urman', 7800.0), ('Popp', 6900.0), ('Raphaely', 11000.0), ('Khoo', 3100.0), ('Baida', 2900.0), ('Tobias', 2800.0), ('Himuro', 2600.0), ('Colmenares', 2500.0), ('Weiss', 8000.0), ('Fripp', 8200.0), ('Kaufling', 7900.0), ('Vollman', 6500.0), ('Mourgos', 5800.0), ('Nayer', 3200.0), ('Mikkilineni', 2700.0), ('Landry', 2400.0), ('Markle', 2200.0), ('Bissot', 3300.0), ('Atkinson', 2800.0), ('Marlow', 2500.0), ('Olson', 2100.0), ('Mallin', 3300.0), ('Rogers', 2900.0), ('Gee', 2400.0), ('Philtanker', 2200.0), ('Ladwig', 3600.0), ('Stiles', 3200.0), ('Seo', 2700.0), ('Patel', 2500.0), ('Rajs', 3500.0), ('Davies', 3100.0), ('Matos', 2600.0), ('Vargas', 2500.0), ('Russell', 14000.0), ('Partners', 13500.0), ('Errazuriz', 12000.0), ('Cambrault', 11000.0), ('Zlotkey', 10500.0), ('Tucker', 10000.0), ('Bernstein', 9500.0), ('Hall', 9000.0), ('Olsen', 8000.0), ('Cambrault', 7500.0), ('Tuvault', 7000.0), ('King', 10000.0), ('Sully', 9500.0), ('McEwen', 9000.0), ('Smith', 8000.0), ('Doran', 7500.0), ('Sewall', 7000.0), ('Vishney', 10500.0), ('Greene', 9500.0), ('Marvins', 7200.0), ('Lee', 6800.0), ('Ande', 6400.0), ('Banda', 6200.0), ('Ozer', 11500.0), ('Bloom', 10000.0), ('Fox', 9600.0), ('Smith', 7400.0), ('Bates', 7300.0), ('Kumar', 6100.0), ('Abel', 11000.0), ('Hutton', 8800.0), ('Taylor', 8600.0), ('Livingston', 8400.0), ('Grant', 7000.0), ('Johnson', 6200.0), ('Taylor', 3200.0), ('Fleaur', 3100.0), ('Sullivan', 2500.0), ('Geoni', 2800.0), ('Sarchand', 4200.0), ('Bull', 4100.0), ('Dellinger', 3400.0), ('Cabrio', 3000.0), ('Chung', 3800.0), ('Dilly', 3600.0), ('Gates', 2900.0), ('Perkins', 2500.0), ('Bell', 4000.0), ('Everett', 3900.0), ('McCain', 3200.0), ('Jones', 2800.0), ('Walsh', 3100.0), ('Feeney', 3000.0), ('OConnell', 2600.0), ('Grant', 2600.0), ('Whalen', 4400.0), ('Hartstein', 13000.0), ('Fay', 6000.0), ('Mavris', 6500.0), ('Baer', 10000.0), ('Higgins', 12008.0), ('Gietz', 8300.0)]

In [18]:
class DAO:
    
    import cx_Oracle
    
    def select(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id, db_pw, db_url)
        
        curs = conn.cursor()
        sql = 'select last_name, salary from employees'
        curs.execute(sql)
        result = curs.execute(sql)
        r = result.fetchall()
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()
        
        return r

In [21]:
dao = DAO()
r = dao.select()

# for name, salary in r:
#     print('name : {} / salary : {}'.format(name, salary))

name : King / salary : 24000.0
name : Kochhar / salary : 17000.0
name : De Haan / salary : 17000.0
name : Hunold / salary : 9000.0
name : Ernst / salary : 6000.0
name : Austin / salary : 4800.0
name : Pataballa / salary : 4800.0
name : Lorentz / salary : 4200.0
name : Greenberg / salary : 12008.0
name : Faviet / salary : 9000.0
name : Chen / salary : 8200.0
name : Sciarra / salary : 7700.0
name : Urman / salary : 7800.0
name : Popp / salary : 6900.0
name : Raphaely / salary : 11000.0
name : Khoo / salary : 3100.0
name : Baida / salary : 2900.0
name : Tobias / salary : 2800.0
name : Himuro / salary : 2600.0
name : Colmenares / salary : 2500.0
name : Weiss / salary : 8000.0
name : Fripp / salary : 8200.0
name : Kaufling / salary : 7900.0
name : Vollman / salary : 6500.0
name : Mourgos / salary : 5800.0
name : Nayer / salary : 3200.0
name : Mikkilineni / salary : 2700.0
name : Landry / salary : 2400.0
name : Markle / salary : 2200.0
name : Bissot / salary : 3300.0
name : Atkinson / salary : 2800.0
name : Marlow / salary : 2500.0
name : Olson / salary : 2100.0
name : Mallin / salary : 3300.0
name : Rogers / salary : 2900.0
name : Gee / salary : 2400.0
name : Philtanker / salary : 2200.0
name : Ladwig / salary : 3600.0
name : Stiles / salary : 3200.0
name : Seo / salary : 2700.0
name : Patel / salary : 2500.0
name : Rajs / salary : 3500.0
name : Davies / salary : 3100.0
name : Matos / salary : 2600.0
name : Vargas / salary : 2500.0
name : Russell / salary : 14000.0
name : Partners / salary : 13500.0
name : Errazuriz / salary : 12000.0
name : Cambrault / salary : 11000.0
name : Zlotkey / salary : 10500.0
name : Tucker / salary : 10000.0
name : Bernstein / salary : 9500.0
name : Hall / salary : 9000.0
name : Olsen / salary : 8000.0
name : Cambrault / salary : 7500.0
name : Tuvault / salary : 7000.0
name : King / salary : 10000.0
name : Sully / salary : 9500.0
name : McEwen / salary : 9000.0
name : Smith / salary : 8000.0
name : Doran / salary : 7500.0
name : Sewall / salary : 7000.0
name : Vishney / salary : 10500.0
name : Greene / salary : 9500.0
name : Marvins / salary : 7200.0
name : Lee / salary : 6800.0
name : Ande / salary : 6400.0
name : Banda / salary : 6200.0
name : Ozer / salary : 11500.0
name : Bloom / salary : 10000.0
name : Fox / salary : 9600.0
name : Smith / salary : 7400.0
name : Bates / salary : 7300.0
name : Kumar / salary : 6100.0
name : Abel / salary : 11000.0
name : Hutton / salary : 8800.0
name : Taylor / salary : 8600.0
name : Livingston / salary : 8400.0
name : Grant / salary : 7000.0
name : Johnson / salary : 6200.0
name : Taylor / salary : 3200.0
name : Fleaur / salary : 3100.0
name : Sullivan / salary : 2500.0
name : Geoni / salary : 2800.0
name : Sarchand / salary : 4200.0
name : Bull / salary : 4100.0
name : Dellinger / salary : 3400.0
name : Cabrio / salary : 3000.0
name : Chung / salary : 3800.0
name : Dilly / salary : 3600.0
name : Gates / salary : 2900.0
name : Perkins / salary : 2500.0
name : Bell / salary : 4000.0
name : Everett / salary : 3900.0
name : McCain / salary : 3200.0
name : Jones / salary : 2800.0
name : Walsh / salary : 3100.0
name : Feeney / salary : 3000.0
name : OConnell / salary : 2600.0
name : Grant / salary : 2600.0
name : Whalen / salary : 4400.0
name : Hartstein / salary : 13000.0
name : Fay / salary : 6000.0
name : Mavris / salary : 6500.0
name : Baer / salary : 10000.0
name : Higgins / salary : 12008.0
name : Gietz / salary : 8300.0

In [11]:
# Python 점수를 저장하려고 함
score = 100
# score 타입은???
type(score)

# 이름을 저장하려고 함
name = '나예호'
type(name)

# 나예호와 Python점수를 동시에 저장
# class를 사용!!!

str

In [ ]:
# VO(Value Object)
# 사용자 정의 데이터 타입

# Design Pattern
# 코드를 작성
# Refactoring 

# 가장 보편적, 가장 많이 사용하는 약속된 Design
# MVC : Model, View, Controller

In [14]:
class Scores:
    
    name = ''
    score = 0
    
    def print_info(self):
        print('이름은 : {} / 점수 : {}'.format(self.name, self.score))

In [15]:
s1 = Scores()
s1.name = '나예호'
s1.score = 100

s1.print_info()

이름은 : 나예호 / 점수 : 100

In [57]:
import cx_Oracle
import pandas as pd
class DAO:
    def select(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id, db_pw, db_url)
        curs = conn.cursor()
        sql = 'select last_name, salary from employees'
        curs.execute(sql)
        result = curs.execute(sql)
        r = result.fetchall()
        if curs != None:curs.close()
        if conn != None:conn.close()
        return r
    
    def select_df(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id,db_pw,db_url)
        sql = 'select last_name, salary from employees'
        df = pd.read_sql(sql, conn)
        conn.close()
        return df
    
# sql문과 db_id, db_pw, db_url 값 바꿔주면 oracle값 불러올 수 있음

In [42]:
# sql문 접근 또는  DF를 불리언 인덱싱으로 접근해서 조회
dao = DAO()
dao.select_df()

C:\Users\AI\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    LAST_NAME   SALARY
0        King  24000.0
1     Kochhar  17000.0
2     De Haan  17000.0
3   Greenberg  12008.0
4    Raphaely  11000.0
5     Russell  14000.0
6    Partners  13500.0
7   Errazuriz  12000.0
8   Cambrault  11000.0
9     Zlotkey  10500.0
10     Tucker  10000.0
11       King  10000.0
12    Vishney  10500.0
13       Ozer  11500.0
14      Bloom  10000.0
15       Abel  11000.0
16  Hartstein  13000.0
17       Baer  10000.0
18    Higgins  12008.0

In [58]:
dao = DAO()
data = dao.select_df()
data[data['SALARY']>=10000]

C:\Users\AI\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     LAST_NAME   SALARY
0         King  24000.0
1      Kochhar  17000.0
2      De Haan  17000.0
8    Greenberg  12008.0
14    Raphaely  11000.0
45     Russell  14000.0
46    Partners  13500.0
47   Errazuriz  12000.0
48   Cambrault  11000.0
49     Zlotkey  10500.0
50      Tucker  10000.0
56        King  10000.0
62     Vishney  10500.0
68        Ozer  11500.0
69       Bloom  10000.0
74        Abel  11000.0
101  Hartstein  13000.0
104       Baer  10000.0
105    Higgins  12008.0

In [36]:
import socket
s = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
s.connect(("8.8.8.8", 80))
host_ip = s.getsockname()[0]

from flask import Flask, redirect

app = Flask(__name__)

@app.route('/')
def index():
    return '<h1>Hello World</h1>'

@app.route('/sel_emp')
def sel_emp():
    dao = DAO()
    r = dao.select()
    
    result = '</br>'.join(map(str,r))
    
    return result

if __name__ == '__main__':
    app.run(host=f'{host_ip}', port=5023)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://192.168.70.172:5023/ (Press CTRL+C to quit)
192.168.70.172 - - [22/Sep/2022 12:28:12] "GET / HTTP/1.1" 200 -
192.168.70.172 - - [22/Sep/2022 12:28:19] "GET /sel_emp HTTP/1.1" 200 -

## 회원가입 코드 설계(9/23)

In [ ]:
# member 테이블 잘 불러와지는지 확인

In [23]:
import cx_Oracle
import pandas as pd
class DAO:
    def select(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id, db_pw, db_url)
        curs = conn.cursor()
        sql = 'select last_name, salary from employees'
        curs.execute(sql)
        result = curs.execute(sql)
        r = result.fetchall()
        if curs != None:curs.close()
        if conn != None:conn.close()
        return r
    
    def select_df(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id,db_pw,db_url)
        sql = 'select * from member'
        df = pd.read_sql(sql, conn)
        conn.close()
        return df
    # class 안의 함수에서는 self 써줘야 함
    # insert 함수 사용할 때 값 3개 정의해주어야 함
    def insert(self, join_id, join_pw, join_name):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id,db_pw,db_url)
        
        curs = conn.cursor()
        # sql문 tab 사용 가능, 문자에 '' 사용해야 함
        # :1, :2, :3 : 정해지지 않은 값(execute에서 sql변수 뒤에 정의해줘야 됨)
        sql = '''insert into member(memid, id, pw, name)
        values (mem_memid_seq.nextval, :1, :2, :3)'''
        curs.execute(sql, (join_id, join_pw, join_name))
        
        conn.commit()
        
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()

In [24]:
dao = DAO()
dao.insert('ysw8','0923','sw8')
dao.select_df()

None

C:\Users\AI\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   MEMID    ID    PW       NAME  MONEY
0    140  ysw2  1234        sw2  10000
1    141  ysw3  1234        sw3  10000
2    142  ysw4  1234        sw4  10000
3    143  ysw5  1234        sw5  10000
4    144  ysw6  0923        sw6  10000
5    146  ysw8  0923        sw8  10000
6    101   ysw  1234  seungwook  10000
7    145  ysw7  0923        sw7  10000

In [19]:
dao = DAO()
df = dao.select_df()
df

C:\Users\AI\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   MEMID    ID    PW       NAME  MONEY
0    140  ysw2  1234        sw2  10000
1    141  ysw3  1234        sw3  10000
2    142  ysw4  1234        sw4  10000
3    143  ysw5  1234        sw5  10000
4    101   ysw  1234  seungwook  10000

In [ ]:
# 로그인

In [1]:
import cx_Oracle
import pandas as pd
class DAO:
    
    # db 함수 접속
    def conn_db(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id,db_pw,db_url)
        
        curs = conn.cursor()
        return conn, curs
    
    def select(self):
        conn, curs = self.conn_db()
        sql = 'select last_name, salary from employees'
        curs.execute(sql)
        result = curs.execute(sql)
        r = result.fetchall()
        if curs != None:curs.close()
        if conn != None:conn.close()
        return r
    
    def select_df(self):
        conn, curs = self.conn_db()
        sql = 'select * from member'
        df = pd.read_sql(sql, conn)
        conn.close()
        return df
    
    # class 안의 함수에서는 self 써줘야 함
    # insert 함수 사용할 때 값 3개 정의해주어야 함
    def insert(self, join_id, join_pw, join_name):
        conn, curs = self.conn_db()
        
        # sql문 tab 사용 가능, 문자에 '' 사용해야 함
        # :1, :2, :3 : 정해지지 않은 값(execute에서 sql변수 뒤에 정의해줘야 됨)
        sql = '''insert into member(memid, id, pw, name)
        values (mem_memid_seq.nextval, :1, :2, :3)'''
        curs.execute(sql, (join_id, join_pw, join_name))
        
        conn.commit()
        
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()
    
    def login(self, login_id, login_pw):
        conn, curs = self.conn_db()
        
        # select는 commit 하지 않음
        #sql = '''select count(*) from member where id = 'ysw' and pw = '1234' '''
        sql = '''select count(*) from member where id = :1 and pw = :2 '''
        result = curs.execute(sql, (login_id, login_pw))
        # fetchone 대신 fetchall 사용 시 리스트로 출력
        cnt = result.fetchone()
        
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()
        
        return cnt[0]

In [57]:
dao = DAO()
#dao.login('1','2')
dao.login('ysw', '1234')

# 출력되는 값이 1이면 로그인 성공, 0이면 로그인 실패

1

In [66]:
# redirect : 페이지 전체가 이동
from flask import Flask, request, redirect

app = Flask(__name__)
@app.route('/')
def index():
    return '<h1>Hello World</h1>'

@app.route('/login', methods=['GET', 'POST'])

def login_db():
    # get방식은 args, post 방식은 form
    if request.method == 'POST':
        # html문서의 input태그의 name 값
        login_id = request.form['login_id']
        login_pw = request.form['login_pw']
        
        print(login_id, login_pw)
        
        dao = DAO()
        cnt = dao.login(login_id, login_pw)
        
        if cnt == 1:
            url_success = 'http://nayeho.dothome.co.kr/success.html'
            return redirect(url_success)
        else:
            url_fail = 'http://nayeho.dothome.co.kr/fail.html'
            return redirect(url_fail)
        
if __name__ == '__main__':
    app.run(host='192.168.70.172', port=5023)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://192.168.70.172:5023/ (Press CTRL+C to quit)
192.168.70.172 - - [23/Sep/2022 12:18:27] "POST /login HTTP/1.1" 302 -

1 1

192.168.70.172 - - [23/Sep/2022 12:18:35] "POST /login HTTP/1.1" 302 -

ysw 1234

192.168.70.175 - - [23/Sep/2022 12:21:42] "POST /login HTTP/1.1" 302 -

ysw1 1234

192.168.70.254 - - [23/Sep/2022 12:32:06] "POST /login HTTP/1.1" 302 -

ysw 1234

- 1. flask 서버 실행
- 2. vs code쪽 index.html을 Live Server로 올려주세요 (단축키 : Alt + L + O)
- 3. 띄워진 웹 페이지에서 ID와 PW를 입력 후 '로그인' 버튼 클릭
- 4. jupyter notebook 쪽 cell 창에서 넘어 온 ID와 PW를 확인!!

In [39]:
dao = DAO()
#dao.insert('ysw9','0923','sw9')
dao.select_df()

C:\Users\AI\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   MEMID    ID    PW       NAME  MONEY
0    140  ysw2  1234        sw2  10000
1    141  ysw3  1234        sw3  10000
2    142  ysw4  1234        sw4  10000
3    143  ysw5  1234        sw5  10000
4    144  ysw6  0923        sw6  10000
5    146  ysw8  0923        sw8  10000
6    101   ysw  1234  seungwook  10000
7    145  ysw7  0923        sw7  10000
8    147  ysw9  0923        sw9  10000

- 9/26(월)

In [17]:
# oracle DB
import cx_Oracle
import pandas as pd
class DAO:
    
    # db 함수 접속
    def conn_db(self):
        db_id = 'hr'
        db_pw = 'hr'
        db_url = '127.0.0.1:1521/xe'
        conn = cx_Oracle.connect(db_id,db_pw,db_url)
        
        curs = conn.cursor()
        return conn, curs
    
    def select(self):
        conn, curs = self.conn_db()
        sql = 'select last_name, salary from employees'
        curs.execute(sql)
        result = curs.execute(sql)
        r = result.fetchall()
        if curs != None:curs.close()
        if conn != None:conn.close()
        return r
    
    def select_df(self):
        conn, curs = self.conn_db()
        sql = 'select * from member'
        df = pd.read_sql(sql, conn)
        conn.close()
        return df
    
    # class 안의 함수에서는 self 써줘야 함
    # insert 함수 사용할 때 값 3개 정의해주어야 함
    def insert(self, join_id, join_pw, join_name):
        conn, curs = self.conn_db()
        
        # sql문 tab 사용 가능, 문자에 '' 사용해야 함
        # :1, :2, :3 : 정해지지 않은 값(execute에서 sql변수 뒤에 정의해줘야 됨)
        sql = '''insert into member(memid, id, pw, name)
        values (mem_memid_seq.nextval, :1, :2, :3)'''
        curs.execute(sql, (join_id, join_pw, join_name))
        
        conn.commit()
        
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()
    
    def login(self, login_id, login_pw):
        conn, curs = self.conn_db()
        
        # select는 commit 하지 않음
        #sql = '''select count(*) from member where id = 'ysw' and pw = '1234' '''
        sql = '''select count(*) from member where id = :1 and pw = :2 '''
        result = curs.execute(sql, (login_id, login_pw))
        # fetchone 대신 fetchall 사용 시 리스트로 출력
        cnt = result.fetchone()
        
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()
        
        return cnt[0]
    
    # login_id 중복체크
    def check(self, login_id):
        conn, curs = self.conn_db()
        
        # select는 commit 하지 않음
        #sql = '''select count(*) from member where id = 'ysw' and pw = '1234' '''
        sql = '''select count(*) from member where id = :1 '''
        result = curs.execute(sql, (login_id,))  # login_id 뒤에 , 필요(리스트로 저장 필요)
        #result = curs.execute(sql, [login_id])
        # fetchone 대신 fetchall 사용 시 리스트로 출력
        cnt = result.fetchone()
        
        if curs != None:
            curs.close()
        if conn != None:
            conn.close()
        
        return cnt[0]

In [20]:
dao = DAO()
#dao.login('1','2')
dao.check('ysw')

1

In [19]:
# flask server
# redirect : 페이지 전체가 이동

import socket
s = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
s.connect(("8.8.8.8", 80))
host_ip = s.getsockname()[0]

from flask import Flask, request, redirect

app = Flask(__name__)
@app.route('/')
def index():
    return '<h1>Hello World</h1>'

# 회원가입
@app.route('/join', methods=['POST'])
def join():
    if request.method == 'POST':
        # form ['joinid'] : html과 같은 이름으로 해야 함
        join_id = request.form['join_id']
        join_pw = request.form['join_pw']
        join_name = request.form['join_name']
        print(join_id, join_pw, join_name)
        dao = DAO()
        try:
            dao.insert(join_id, join_pw, join_name)
            return redirect('/success')
        except:
            return redirect(f'http://{host_ip}:5500/index.html')
        
@app.route('/success')
def success():
    return '<h1>회원가입 성공</h1>'

@app.route('/check', methods=['POST'])
def check_id():
    if request.method == 'POST':
        join_id = request.form['join_id']
        
        dao = DAO()
        cnt = dao.check(join_id)
        return cnt
    

@app.route('/login', methods=['GET', 'POST'])

def login_db():
    # get방식은 args, post 방식은 form
    if request.method == 'POST':
        # html문서의 input태그의 name 값
        login_id = request.form['login_id']
        login_pw = request.form['login_pw']
        
        print(login_id, login_pw)
        
        dao = DAO()
        cnt = dao.login(login_id, login_pw)
        
        if cnt == 1:
            url_success = 'http://seungwook.dothome.co.kr/success.html'
            return redirect(url_success)
        else:
            url_fail = 'http://seungwook.dothome.co.kr/fail.html'
            return redirect(url_fail)
        
if __name__ == '__main__':
    app.run(host=f'{host_ip}', port=5023)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://192.168.70.58:5023/ (Press CTRL+C to quit)
192.168.70.58 - - [26/Sep/2022 11:17:57] "GET / HTTP/1.1" 200 -
192.168.70.58 - - [26/Sep/2022 11:18:32] "POST /check HTTP/1.1" 400 -
192.168.70.58 - - [26/Sep/2022 11:18:40] "POST /check HTTP/1.1" 400 -

10/7 웹뷰 -> Flask서버로 get방식

In [4]:
# 웹뷰 - 중요
from flask import Flask,request

app = Flask(__name__)

@app.route('/')
def index():
    return "Hello World"

@app.route('/login', methods=['GET', 'POST'])
def login2():
    login_id = request.args['login_id']
    login_pw = request.args['login_pw']
    
    print(login_id, login_pw)
    
    return '로그인 페이지'

if __name__ == '__main__':
    app.run(host='192.168.70.58', port=5023)

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://192.168.70.58:5023/ (Press CTRL+C to quit)
192.168.70.58 - - [07/Oct/2022 17:03:29] "GET /login?login_id=ysw&login_pw=1234 HTTP/1.1" 200 -

ysw 1234